example TF Template with scenario of after_unknown value:
`
resource "aws_kms_key" "kms_key" {
  description             = "KMS key 1"
  deletion_window_in_days = 10
}


data "aws_iam_policy_document" "iam_policy_document" {
    statement {
        effect = "Allow"
        actions = ["kms:*"]
        resources =  ["${aws_kms_key.kms_key.arn}"]
    }
}

resource "aws_iam_policy" "iam_policy" {
    name = "iam_policy"
    policy = "${data.aws_iam_policy_document.iam_policy_document.json}"
    
}
`

resulting output of plan
`  # aws_iam_policy.iam_policy will be created
  + resource "aws_iam_policy" "iam_policy" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "iam_policy"
      + path        = "/"
      + policy      = (known after apply)
    }`